In [8]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

pd.options.display.max_columns = None

In [9]:
df = pd.read_csv("attacks_columnas_limpias.csv", index_col = 0)
df.sample(5)

,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,fatal_(y/n),injury,date
1587,2006.10.10,2006.0,Unprovoked,usa,Florida,"Daytona Beach, Volusia County",Surfing,Kyle Cody,M,20,11h30,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,N,Left ankle bitten,10-Oct-2006
372,2016.10.21,2016.0,Unprovoked,usa,Hawaii,"Hooipa Beach Park, Maui",Surfing,Federico Jaime,M,36,17h00,6' to 8' shark,http://sharkattackfile.net/spreadsheets/pdf_di...,N,Left arm and leg injured,21-Oct-2016
1508,2007.08.20,2007.0,Provoked,usa,Delaware,"Indian River Inlet, Rehoboth Beach",Fishing,male,M,NaN,19h45,Sandtiger shark,http://sharkattackfile.net/spreadsheets/pdf_di...,N,Forearm bitten by hooked shark PROVOKED INCIDENT,20-Aug-2007
1339,2009.01.10.R,2009.0,Boat,new zealand,North Island,Hawkes Bay,Fishing,Bry & David Mossman & 2 friends,NaN,NaN,NaN,"Mako shark, 3m",http://sharkattackfile.net/spreadsheets/pdf_di...,N,"No injury to occupants, shark hit boat & bit o...",10-Jan-2009
2312,1998.12.15,1998.0,Unprovoked,australia,South Australia,Middleton Beach,Surfing,NaN,F,21,Afternoon,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,N,Leg injured,15-Dec-1998

<font color = 'sky blue'> EJERCICIO 1: Lo primero qué tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¿Hay alguna columna con una gran cantidad de nulos? En caso de que sea así deberemos eliminarla.

In [10]:
nulos = pd.DataFrame((df.isnull().sum() * 100) / df.shape[0]).reset_index()
nulos.columns = ["columna", "porcentaje"]
nulos

        columna  porcentaje
0   case_number    0.015913
1          year    0.000000
2          type    0.063654
3       country    0.795672
4          area    7.224698
5      location    8.577339
6      activity    8.625080
7          name    3.325907
8          sex_    8.975175
9           age   44.875875
10         time   53.150859
11     species_   45.050923
12         href    0.000000
13  fatal_(y/n)    8.497772
14       injury    0.445576
15         date    0.000000

<font color = 'sky blue'> EJERCICIO 2:
 - Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [11]:
df['age'].fillna(df['age'].median ,inplace = True)

In [12]:
df.isnull().sum()

case_number       1
year              0
type              4
country          50
area            454
location        539
activity        542
name            209
sex_            564
age               0
time           3340
species_       2831
href              0
fatal_(y/n)     534
injury           28
date              0
dtype: int64

<font color = 'sky blue'> 
 - En relación a la columna de country al tratarse de una columna de tipo categórica, reemplazad los valores nulos por una nueva categória que se llame Unknown.

In [14]:
df['country'].replace(np.nan, "Unknown", inplace = True)

In [15]:
df.isnull().sum()

case_number       1
year              0
type              4
country           0
area            454
location        539
activity        542
name            209
sex_            564
age               0
time           3340
species_       2831
href              0
fatal_(y/n)     534
injury           28
date              0
dtype: int64

<font color = 'sky blue'> - Reemplazad los valores nulos de la columna fatal por Unknown

In [17]:
df['fatal_(y/n)'].replace(np.nan, "Unknown", inplace = True)

In [18]:
df.isnull().sum()

case_number       1
year              0
type              4
country           0
area            454
location        539
activity        542
name            209
sex_            564
age               0
time           3340
species_       2831
href              0
fatal_(y/n)       0
injury           28
date              0
dtype: int64

<font color = 'sky blue'> - Reemplazad los valores nulos de la columna type por el valor más frecuente (la moda)

In [20]:
df["type"].replace(np.nan, df.type.mode()[0], inplace = True)

In [21]:
df.isnull().sum()

case_number       1
year              0
type              0
country           0
area            454
location        539
activity        542
name            209
sex_            564
age               0
time           3340
species_       2831
href              0
fatal_(y/n)       0
injury           28
date              0
dtype: int64

<font color = 'sky blue'> - Reemplazad los valores nulos de la columna fecha por Unknown

In [22]:
df['date'].replace(np.nan, "Unknown", inplace = True)

In [23]:
df.isnull().sum()

case_number       1
year              0
type              0
country           0
area            454
location        539
activity        542
name            209
sex_            564
age               0
time           3340
species_       2831
href              0
fatal_(y/n)       0
injury           28
date              0
dtype: int64

<font color = 'sky blue'>  EJERCICIO 3: Guardad el csv para seguir trabajando con el en los siguientes ejercicios de pair

In [ ]:
df.to_csv('attacks_columnas_nulos_limpios.csv')

<font color = 'red'>(está todo hecho pero no nos da error al abrir el df. 
Dice: recursion error: maximum recursion depth exceeded while calling a Python object)